import TypoH2 from "./ui/TypoH2";

const questionsAndAnswers = [
  {
    q: "כמה זמן לוקח תהליך ייצור פריט עץ מותאם אישית?",
    a: "משך הזמן תלוי במורכבות הפריט ובדרישות הלקוח. פריטים קטנים ופשוטים יכולים להימשך מספר ימים, בעוד פריטים גדולים ומורכבים עשויים לקחת מספר שבועות.",
  },
  {
    q: "האם אתם עובדים עם מעצבים ואדריכלים?",
    a: "בהחלט! אנחנו משתפים פעולה עם מעצבים ואדריכלים כדי להביא לחיים את החזון שלהם באמצעות עבודות עץ מדויקות ואיכותיות.",
  },
  {
    q: "האם ניתן לקבל הדמיה או סקיצה של הפריט לפני ייצורו?",
    a: "כן, אנחנו מספקים סקיצות והדמיות כדי להבטיח שהעיצוב תואם את הציפיות שלכם לפני תחילת תהליך הייצור.",
  },
  {
    q: "איזה סוגי עץ אתם מציעים?",
    a: "אנו עובדים עם מגוון רחב של עצים, כולל אלון, אגוז, ליבנה, אורן ועוד. נוכל להמליץ על סוג העץ המתאים ביותר לפרויקט שלכם.",
  },
  {
    q: "האם אתם מציעים פתרונות מותאמים אישית ללקוחות פרטיים ועסקיים?",
    a: "כן, אנו מתמחים במתן פתרונות מותאמים אישית גם ללקוחות פרטיים וגם לעסקים, תוך התאמה מושלמת לצרכים ולדרישות שלהם.",
  },
  {
    q: "האם אתם מספקים שירותי התקנה?",
    a: "כן, אנחנו מציעים שירותי התקנה מקצועיים כדי לוודא שהמוצר שלכם מותקן בצורה מדויקת ובטוחה.",
  },
  {
    q: "האם אתם משתמשים בחומרים ידידותיים לסביבה?",
    a: "בהחלט! אנחנו מקפידים על שימוש בעץ ממקורות ברי-קיימא ובתהליכי ייצור ידידותיים לסביבה.",
  },
];

export default function FAQ() {
  return (
    <section
      id="faq"
      className="main-wrapper-omar px-4 my-10 sm:px-8 min-h-[500px] flex flex-col items-center gap-10"
    >
      <TypoH2>שאלות ותשובות</TypoH2>
      <div
        className="flex flex-col gap-4 w-full  justify-center max-w-2xl mx-auto"
        dir="rtl"
      >
        {questionsAndAnswers.map((item, index) => {
          return (
            <details
              key={index}
              className="pb-3 hover:cursor-pointer border-b border-gray-200"
            >
              <summary className="text-right">{item.q}</summary>
              <p className="py-4">{item.a}</p>
            </details>
          );
        })}
      </div>
    </section>
  );
}
